import Link from "next/link"
import { Button } from "@/components/ui/button"
import Header from "@/components/header"
import Footer from "@/components/footer"
import { Card } from "@/components/Card"
import { SocialNav } from "@/components/SocialNav"

export default function HomePage() {
  return (
    <div className="">

      <main >
        {/* Hero Section */}
        <Card className="pt-12 pb-7 flex flex-col items-center mb-[130px]">
          <div className="w-[520px]">
            <h1 className="text-2xl md:text-[40px]  mb-8 leading-[50px]">НАШІ ПОСЛУГИ</h1>
            <p className="text-base max-w-2xl mx-auto mb-16">
              ЗАМОВЛЯЙ ПРОФЕСІЙНИЙ ДИЗАЙН, ЩО ВИДІЛИТЬ ТВІЙ БІЗНЕС СЕРЕД КОНКУРЕНТІВ!
            </p>
          </div>
          <Link href="/consultation">
            <Button className="bg-transparent hover:bg-white/20 border-2 border-white text-white text-xl font-bold px-6 py-3 rounded-lg mb-8">
              БЕЗКОШТОВНА КОНСУЛЬТАЦІЯ
            </Button>
          </Link>
          <SocialNav white={true} />
        </Card>

        {/* About Us Section */}
        <section className="flex flex-col items-center text-GRAY w-[834px] mx-auto mb-28">
          <h2 className="text-xl font-bold mb-4">НАШ ПІДХІД</h2>
          <p className="text-xl text-gray-700  font-normal text-center">
            Ми віримо, що ефективний дизайн – це не просто красива картинка, а інструмент, який допомагає бізнесу рости. Наша команда підходить до кожного проєкту з індивідуальним підходом, враховуючи потреби клієнта, особливості бренду та сучасні тенденції. Ми працюємо прозоро, дотримуємося дедлайнів та надаємо найкращі рішення для кожного замовлення.
          </p>
        </section>

        {/* Testimonials Section */}
        <section className=" mb-[108px]">
          <h2 className="text-[40px] font-bold mb-14 text-center">НАШІ ПОСЛУГИ</h2>
          <div className="grid grid-cols-1 md:grid-cols-3 md:grid-rows-2 gap-16 gap-y-24 ">
            <div className="flex flex-col text-center items-center">
              <div className="border-2 border-GRAY w-[58px] h-[58px] rounded-full flex items-center justify-center mb-7">
                <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M6.26501 1.96874C6.41056 2.09557 6.51007 2.26698 6.54805 2.45626C6.58604 2.64554 6.56036 2.84208 6.47501 3.01524C6.45947 3.06628 6.45179 3.11939 6.45226 3.17274C6.45226 3.28299 6.48026 3.49299 6.74451 3.75549C6.87226 3.88324 6.97026 3.97424 7.07701 4.07399C7.16451 4.15449 7.25726 4.23849 7.37451 4.35399C7.60201 4.57099 7.84176 4.82649 8.05701 5.14674C8.50326 5.81699 8.75001 6.65524 8.75001 7.87499C8.75001 8.54349 8.63976 9.16999 8.43851 9.72474C7.86801 11.2997 6.58526 12.25 5.25001 12.25C3.91476 12.25 2.63201 11.298 2.06151 9.72474C1.85106 9.13092 1.74565 8.50498 1.75001 7.87499C1.75001 7.30449 1.90226 6.62374 2.11226 5.99549C2.32226 5.36724 2.61626 4.71449 2.95576 4.18949C3.36001 3.50699 3.92876 2.93474 4.36976 2.54974C4.61242 2.33817 4.86469 2.13788 5.12576 1.94949L5.17826 1.91449L5.19401 1.90224L5.19926 1.89874L5.20276 1.89699C5.36323 1.79002 5.55454 1.73907 5.74695 1.75204C5.93937 1.76502 6.1221 1.8412 6.26676 1.96874M5.25001 14C6.36155 14.0028 7.4385 13.6137 8.29151 12.901C8.32651 13.0107 8.35976 13.1215 8.39126 13.2335C8.75001 14.5495 8.75001 16.177 8.75001 17.4352V17.5C8.75001 21.1015 8.07626 23.24 7.31326 24.5122C7.02416 25.0126 6.64573 25.4557 6.19676 25.8195C6.01817 25.9577 5.82442 26.0751 5.61926 26.1695C5.61926 26.1695 5.39701 26.25 5.25001 26.25C5.12385 26.24 4.99964 26.2129 4.88076 26.1695C4.6756 26.0751 4.48185 25.9577 4.30326 25.8195C3.85428 25.4557 3.47585 25.0126 3.18676 24.5122C2.42376 23.2417 1.75001 21.1015 1.75001 17.5V17.437C1.75001 16.177 1.75001 14.5512 2.10876 13.2317C2.13909 13.1221 2.17234 13.0112 2.20851 12.8992C3.06078 13.6138 4.13781 14.0048 5.25001 14.0035M12.2465 19.2062C11.6399 19.1385 11.0432 19.0005 10.4685 18.795C10.4895 18.354 10.5 17.899 10.5 17.43V16.912C11.0425 17.1692 11.6305 17.3495 12.2465 17.437V14C12.2465 13.0717 12.6153 12.1815 13.2716 11.5251C13.928 10.8687 14.8183 10.5 15.7465 10.5H19.1853C19.0461 9.5324 18.6773 8.61219 18.1098 7.81625C17.5423 7.02031 16.7925 6.37176 15.9231 5.92482C15.0537 5.47787 14.0899 5.24551 13.1124 5.24715C12.1349 5.24879 11.1719 5.48438 10.304 5.93424C10.1665 5.36212 9.93975 4.81525 9.63201 4.31374C10.7662 3.75319 12.0188 3.47416 13.2837 3.50029C14.5486 3.52641 15.7886 3.85692 16.8987 4.46382C18.0089 5.07072 18.9564 5.93616 19.6612 6.98687C20.3659 8.03758 20.8072 9.24262 20.9475 10.5H22.7448C23.673 10.5 24.5633 10.8687 25.2196 11.5251C25.876 12.1815 26.2448 13.0717 26.2448 14V21C26.2448 21.9282 25.876 22.8185 25.2196 23.4749C24.5633 24.1312 23.673 24.5 22.7448 24.5H15.7448C14.8165 24.5 13.9263 24.1312 13.2699 23.4749C12.6135 22.8185 12.2448 21.9282 12.2448 21L12.2465 19.2062ZM20.9493 12.25C20.751 14.0258 19.9548 15.6814 18.6913 16.9448C17.4279 18.2083 15.7723 19.0045 13.9965 19.2027V21C13.9965 21.4641 14.1809 21.9092 14.5091 22.2374C14.8373 22.5656 15.2824 22.75 15.7465 22.75H22.7465C23.2106 22.75 23.6558 22.5656 23.9839 22.2374C24.3121 21.9092 24.4965 21.4641 24.4965 21V14C24.4965 13.5359 24.3121 13.0907 23.9839 12.7626C23.6558 12.4344 23.2106 12.25 22.7465 12.25H20.9493ZM19.1853 12.25H15.7465C15.2824 12.25 14.8373 12.4344 14.5091 12.7626C14.1809 13.0907 13.9965 13.5359 13.9965 14V17.4387C15.3057 17.2501 16.5186 16.6427 17.4539 15.7074C18.3892 14.7721 18.9966 13.5592 19.1853 12.25Z" fill="#353535" />
                </svg>
              </div>

              <h3 className="text-xl mb-6 font-bold">БРЕНДИНГ ТА АЙДЕНТИКА</h3>
              <p className=" text-base ">
                Створення логотипів, брендбуків, фірмового стилю. Брендинг допомагає створити унікальний образ компанії в очах споживачів. Айдентика включає в себе візуальні елементи, які роблять бренд впізнаваним.
              </p>
            </div>
            <div className="flex flex-col text-center items-center">
              <div className="border-2 border-GRAY w-[58px] h-[58px] rounded-full flex items-center justify-center mb-7">
                <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M5 4.55125L12.2225 2.5V10.4488L5 12.5V4.55125ZM5 16.0469L12.2225 13.9956V21.9444L5 23.9956V16.0469ZM15.5556 13.1725L22.7775 11.3888V25.7162L15.5562 27.5L15.5556 13.1725Z" fill="#353535" stroke="#353535" strokeWidth="2" />
                </svg>
              </div>

              <h3 className="text-xl mb-6 font-bold">UI/UX ДИЗАЙН</h3>
              <p className=" text-base ">
                Розробка зручних та стильних інтерфейсів для сайтів та мобільних додатків. UI дизайн відповідає за зовнішній вигляд інтерфейсу та зручність. UX дизайн фокусується на досвіді користувача.
              </p>
            </div>

            <div className="flex flex-col text-center items-center">
              <div className="border-2 border-GRAY w-[58px] h-[58px] rounded-full flex items-center justify-center mb-7">
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M7.825 14.119C6.94788 13.4682 6.23545 12.621 5.74486 11.6452C5.25427 10.6694 4.99916 9.59218 5 8.5C5 4.634 8.134 1.5 12 1.5C15.866 1.5 19 4.634 19 8.5C19 10.7675 17.9215 12.7835 16.25 14.0625" stroke="#353535" strokeWidth="2" />
                  <path fillRule="evenodd" clipRule="evenodd" d="M12 8.5L22 22H2L12 8.5Z" fill="#353535" stroke="#353535" strokeWidth="2" />
                </svg>
              </div>

              <h3 className="text-xl mb-6 font-bold">ГРАФІЧНИЙ ДИЗАЙН</h3>
              <p className=" text-base">
                Створення банерів, рекламних матеріалів, ілюстрацій. Графічний дизайн використовується для візуальної комунікації та передачі повідомлень через зображення та композиції.
              </p>
            </div>

            <div className="flex flex-col text-center items-center">
              <div className="border-2 border-GRAY w-[58px] h-[58px] rounded-full flex items-center justify-center mb-7">
                <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M21.6533 15.3467L23.7467 13.2533L18.7467 8.25332L16.6533 10.3467L11.1333 4.83999C10.0933 3.79999 8.4 3.79999 7.36 4.83999L4.82667 7.37332C3.78667 8.41332 3.78667 10.1067 4.82667 11.1467L10.3333 16.6533L4.2 22.8C4.06667 22.9333 4 23.0933 4 23.28V27.3333C4 27.7067 4.29333 28 4.66667 28H8.72C8.89333 28 9.06667 27.9333 9.18667 27.8L15.3467 21.64L20.8533 27.1467C22.6133 28.9067 24.5333 27.24 24.6267 27.1467L27.16 24.6133C28.2 23.5733 28.2 21.88 27.16 20.84L21.6533 15.3467ZM12.24 14.76L6.72 9.25332L9.24 6.71999L10.9333 8.41332L10.3067 9.06665C10.0574 9.31596 9.91731 9.65408 9.91731 10.0067C9.91731 10.3592 10.0574 10.6973 10.3067 10.9467C10.556 11.196 10.8941 11.336 11.2467 11.336C11.5992 11.336 11.9374 11.196 12.1867 10.9467L12.8267 10.3067L14.76 12.24L12.24 14.76ZM22.7467 25.28L17.24 19.7733L19.7733 17.24L21.7067 19.1733L21.0667 19.8133C20.9432 19.9368 20.8453 20.0833 20.7785 20.2446C20.7117 20.4059 20.6773 20.5787 20.6773 20.7533C20.6773 20.9279 20.7117 21.1008 20.7785 21.262C20.8453 21.4233 20.9432 21.5699 21.0667 21.6933C21.1901 21.8168 21.3367 21.9147 21.4979 21.9815C21.6592 22.0483 21.8321 22.0827 22.0067 22.0827C22.1812 22.0827 22.3541 22.0483 22.5154 21.9815C22.6767 21.9147 22.8232 21.8168 22.9467 21.6933L23.5867 21.0533L25.28 22.7467L22.7467 25.28ZM27.6133 9.38665C27.7369 9.2633 27.835 9.11678 27.9019 8.95548C27.9688 8.79419 28.0033 8.62128 28.0033 8.44665C28.0033 8.27203 27.9688 8.09912 27.9019 7.93782C27.835 7.77652 27.7369 7.63 27.6133 7.50665L24.4933 4.38665C23.8667 3.75999 23 3.99999 22.6133 4.38665L20.1733 6.82665L25.1733 11.8267L27.6133 9.38665Z" fill="#353535" />
                </svg>
              </div>

              <h3 className="text-xl mb-6 font-bold">ДИЗАЙН УПАКОВКИ</h3>
              <p className=" text-base">
                Дизайн упаковки не лише захищає товар, але й привертає увагу покупців на полицях магазинів. Оформлення може стати важливою частиною маркетингової стратегії.
              </p>
            </div>

            <div className="flex flex-col text-center items-center">
              <div className="border-2 border-GRAY w-[58px] h-[58px] rounded-full flex items-center justify-center mb-7">
                <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M11.0834 18.6666C6.57308 18.6666 2.91675 15.0103 2.91675 10.5C2.91675 5.98965 6.57308 2.33331 11.0834 2.33331C15.5937 2.33331 19.2501 5.98965 19.2501 10.5" stroke="#353535" strokeWidth="2" />
                  <path d="M25.6667 10.5H10.5V25.6667H25.6667V10.5Z" fill="#353535" stroke="#353535" strokeWidth="2" />
                </svg>
              </div>

              <h3 className="text-xl mb-6 font-bold">ДИЗАЙН ДЛЯ СОЦ МЕРЕЖ</h3>
              <p className=" text-base">
                Візуальний контент для соціальних мереж має бути яскравим, привабливим та адаптованим під кожну платформу. Він допомагає залучати аудиторію та підтримувати впізнаваність бренду.
              </p>
            </div>

            <div className="flex flex-col text-center items-center">
              <div className="border-2 border-GRAY w-[58px] h-[58px] rounded-full flex items-center justify-center mb-7">
                <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M4.12011 25.7525L12.0751 17.7975M22.0926 14.26L19.7114 21.405C19.6732 21.5193 19.608 21.6227 19.5214 21.7065C19.4348 21.7902 19.3293 21.8519 19.2139 21.8863L4.61636 26.2263C4.48485 26.2653 4.34514 26.2676 4.21245 26.2327C4.07975 26.1979 3.95915 26.1274 3.86377 26.0287C3.76838 25.9301 3.70187 25.8073 3.67148 25.6735C3.64108 25.5397 3.64795 25.4002 3.69136 25.27L8.43136 11.0525C8.46533 10.9504 8.52087 10.8569 8.5942 10.7781C8.66753 10.6994 8.75694 10.6374 8.85636 10.5963L15.5901 7.82376C15.727 7.76722 15.8776 7.75248 16.0228 7.7814C16.1681 7.81032 16.3016 7.8816 16.4064 7.98626L21.9114 13.4925C22.0099 13.591 22.079 13.715 22.111 13.8505C22.143 13.9861 22.1366 14.1279 22.0926 14.26Z" stroke="#353535" strokeWidth="1.5" />
                  <path d="M23.0038 3.97751L25.9588 6.93251C26.1808 7.14496 26.3582 7.39963 26.4805 7.68157C26.6028 7.9635 26.6676 8.26703 26.671 8.57433C26.6744 8.88163 26.6163 9.18651 26.5003 9.47108C26.3843 9.75566 26.2126 10.0142 25.9953 10.2315C25.7779 10.4488 25.5194 10.6205 25.2348 10.7365C24.9503 10.8526 24.6454 10.9106 24.3381 10.9072C24.0308 10.9038 23.7273 10.8391 23.4453 10.7168C23.1634 10.5945 22.9087 10.4171 22.6963 10.195L19.74 7.24001C19.3231 6.8042 19.0933 6.22244 19.1 5.61933C19.1067 5.01621 19.3492 4.43968 19.7757 4.01319C20.2022 3.5867 20.7787 3.34415 21.3818 3.33748C21.985 3.33081 22.568 3.56056 23.0038 3.97751Z" fill="#353535" stroke="#353535" strokeWidth="1.5" />
                  <path d="M14.7264 15.145C14.5534 14.9659 14.3465 14.8231 14.1177 14.7248C13.889 14.6265 13.6429 14.5748 13.394 14.5726C13.145 14.5705 12.8981 14.6179 12.6677 14.7122C12.4373 14.8065 12.2279 14.9457 12.0519 15.1217C11.8758 15.2978 11.7366 15.5071 11.6423 15.7376C11.548 15.968 11.5006 16.2149 11.5028 16.4639C11.5049 16.7128 11.5566 16.9589 11.6549 17.1876C11.7532 17.4164 11.896 17.6233 12.0751 17.7962C12.4287 18.1378 12.9024 18.3268 13.394 18.3225C13.8856 18.3182 14.3559 18.121 14.7035 17.7734C15.0512 17.4258 15.2483 16.9555 15.2526 16.4639C15.2569 15.9722 15.0679 15.4986 14.7264 15.145Z" stroke="#353535" strokeWidth="1.5" />
                </svg>
              </div>

              <h3 className="text-xl mb-6 font-bold">РЕДИЗАЙН</h3>
              <p className=" text-base">
                Оновлення та вдосконалення існуючих проектів. Вдосконалення дизайну є постійним процесом, спрямованим на оптимізацію користувацького досвіду.
              </p>
            </div>
          </div>
        </section>

        {/* CTA Section */}
        <Card className=" p-8 flex flex-col items-start mb-[168px]">
          <h2 className="text-[32px] font-bold text-white mb-1">ЗАМОВЛЯЙ ДИЗАЙН ЛОГОТИПУ</h2>
          <h2 className="text-[32px] font-bold text-white mb-3">ПРЯМО ЗАРАЗ!</h2>
          <p className="text-xl text-white mb-8 max-w-[642px] text-left ">
            Ми створимо унікальний логотип, що відображатиме індивідуальність вашого бренду.
          </p>
          <Link href="/shop">
            <Button className="font-bold bg-transparent text-white hover:bg-white hover:text-pink-500 text-sm px-6 py-[10px] border-2 border-white p-3 transition-all ease-linear duration-300 rounded-xl">ЗАМОВИТИ</Button>
          </Link>
        </Card>
      </main>

    </div>
  )
}
